<?php

/*!
 * ifsoft.co.uk
 *
 * http://ifsoft.com.ua, https://ifsoft.co.uk, https://raccoonsquare.com
 * raccoonsquare@gmail.com
 *
 * Copyright 2012-2020 Demyanchuk Dmitry (raccoonsquare@gmail.com)
 */

if (!defined("APP_SIGNATURE")) {

    header("Location: /");
    exit;
}

?>

<p>Файлы сookie представляют собой небольшие текстовые файлы, размещенные на устройстве для хранения данных, считываемые веб-сервером в домене, в котором они были созданы. Эти данные зачастую состоит из буквенно-цифровых строк, которые обеспечивают уникальную идентификацию вашего компьютера, но могут содержать и иные сведения. Мы используем файлы cookie и аналогичные технологии для хранения и поддержки ваших предпочтений и параметров для выполнения входа в систему, предоставления актуальной рекламы, борьбы с мошенничеством, анализа работы наших продуктов и выполнения других обоснованных задач.</p>
<p>Мы используем cookie-файлы и аналогичные технологии в зависимости от контекста или продукта в описанных ниже целях.</p>

<h3>Хранение параметров и предпочтений.</h3>

<p>Мы используем файлы cookie для хранения предпочтений и параметров на вашем устройстве, а также для улучшения взаимодействия. Например, если вы указываете свой город или геолокацию на нашем веб-сайте, мы, в зависимости от параметров, можем сохранить эти данные в файле cookie, чтобы при следующем посещении сайта вы видели соответствующую местную информацию. Сохранение предпочтений в файлах cookie, например предпочтительного языка, позволяет не настраивать некоторые параметры повторно.</p>

<h3>Вход и аутентификация.</h3>

<p>Мы используем cookie-файлы для проверки подлинности пользователя. Когда вы входите на сайт, используя личную учетную запись <?php echo APP_NAME; ?>, мы сохраняем на вашем устройстве уникальный код и время входа в зашифрованном сookie-файле. Этот файл сookie позволит перемещаться между страницами в пределах веб-сайта без необходимости выполнения входа на каждой странице. Можно также сохранить данные для входа, чтобы вам не приходилось выполнять вход при каждом посещении сайта.</p>

<h3>Безопасность.</h3>

<p>Мы используем cookie-файлы для обработки информации, которая помогает нам защищать наши продукты, а также выявлять попытки мошенничества и злоупотребления.</p>

<h3>Производительность.</h3>

<p><?php echo APP_NAME; ?> использует файлы cookie для анализа и повышения производительности наших продуктов. Например, мы используем файлы cookie для сбора данных, которые помогают балансировать нагрузку для поддержки работоспособности веб-сайтов.</p>

<h3>Аналитика.</h3>

<p>Мы используем наши файлы cookie, файлы cookie третьих сторон и другие идентификаторы применяемые для сбора информации об использовании и производительности наших продуктов, что позволяет обеспечивать их надлежащее функционирование. Например, мы используем файлы cookie для учета количества уникальных посетителей веб-страницы или службы, а также для получения других статистических данных, связанных с функционированием наших продуктов.</p>

<h3>Отображение рекламы.</h3>

<p><?php echo APP_NAME; ?> использует cookie-файлы для подсчета количества посетителей, щелкнувших по объявлению, и учета просмотренных вами рекламных материалов, чтобы, например, не показывать вам одну и ту же рекламу повторно.</p>

<h3>Социальные сети.</h3>

<p>Некоторые наши веб-сайты используют cookie-файлы социальных сетей, в том числе тех, которые позволяют пользователям, выполнившим вход в социальную сеть, делиться содержимым со своими друзьями и подписчиками с помощью этой сети.</p>

<h3>Хранение информации, предоставляемой веб-сайту.</h3>

<p>Мы используем cookie-файлы для хранения сведений, предоставленных вами. Когда вы предоставляете информацию <?php echo APP_NAME; ?>, например при выборе фильтров поиска на веб-сайте, мы сохраняем данные в cookie-файле, чтобы запомнить параметры, которые вы сделали.</p>

<h3>Разное.</h3>

<p>Когда вы посещаете веб-сайт <?php echo APP_NAME; ?>, помимо файлов cookie, создаваемых <?php echo APP_NAME; ?>, на вашем устройстве могут сохраняться файлы cookie сторонних компаний. Например: Google Analytics (<a target="_blank" rel="nofollow" href="https://www.google.com/analytics">https://www.google.com/analytics</a>)</p>
<p>В большинстве браузеров использоание сookie-файлов принимается автоматически, но у пользователя есть возможность управлять параметрами браузера для блокирования или удаления сookie-файлов. Например, если Вы используете Google Chrome, зайдите в "Настройки", нажмите "Дополнительные настройки", в меню "Личные данные" нажмите "Настройки контента". В разделе "Файлы cookie" можно запретить использование "куки" для всех сайтов или выборочно. Так же вы всегда можете использовать Блокировщик Google Analytics: <a rel="nofollow" target="_blank" href="https://tools.google.com/dlpage/gaoptout/?hl=ru">https://tools.google.com/dlpage/gaoptout/?hl=ru</a>.</p>
<p>Некоторые функции <?php echo APP_NAME; ?> зависят от использования файлов cookie. Если вы решите заблокировать файлы сookie, вы не сможете входить в систему или использовать функции и настройки, зависящие от файлов сookie. При удалении cookie-файлов удаляются любые хранящиеся в этих файлах параметры и предпочтения, включая параметры, касающиеся рекламы; впоследствии потребуется создать их заново.</p>