<?php

/*!
 * ifsoft.co.uk
 *
 * http://ifsoft.com.ua, https://ifsoft.co.uk, https://raccoonsquare.com
 * raccoonsquare@gmail.com
 *
 * Copyright 2012-2020 Demyanchuk Dmitry (raccoonsquare@gmail.com)
 */

if (!defined("APP_SIGNATURE")) {

    header("Location: /");
    exit;
}

?>

<p><strong><?php echo APP_NAME; ?></strong> (<?php echo APP_TITLE; ?>) - сервис объявлений.</p>
<p>Хотите продать ненужную вещь? Хотите купить диван, письменный стол, автомобиль, телефон? Нужна работа или жилье в аренду? Все объявления <strong><?php echo APP_NAME; ?></strong> доступны с вашего смартфона, планшета или с сайта! Используйте все возможности <strong><?php echo APP_NAME; ?></strong> для поиска нужной вещи в любое удобное время.</p>
<p>Хотите добавление объявление? Это легкое как никогда. Просто выберите категорию, вставьте короткое описание, фото и укажите местоположение. Готово!</p>
<p>Используя приложение Вы можете публиковать фото прямо с телефона в ваше объявление. Вам не придется искать кабель, чтобы подключиться к компьютеру. Также вы будете получать Push-уведомления о каждом новом сообщении/ответе прямо на телефон или планшет - даже если приложение неактивно.</p>
<p>Используйте <strong><?php echo APP_NAME; ?></strong>, чтобы быстро купить вещь или найти услугу!</p>
